; ModuleID = 'xdp_pass_kern.c'
source_filename = "xdp_pass_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.udphdr = type { i16, i16, i16, i16 }

@suf_end = dso_local local_unnamed_addr constant i32 30, align 4, !dbg !0
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !52
@llvm.compiler.used = appending global [2 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_patch_ports_func to i8*)], section "llvm.metadata"

; Function Attrs: nofree norecurse nosync nounwind readonly
define dso_local i32 @is_suffix(i8* nocapture readonly %0, i8* nocapture readonly %1) local_unnamed_addr #0 !dbg !65 {
  call void @llvm.dbg.value(metadata i8* %0, metadata !71, metadata !DIExpression()), !dbg !76
  call void @llvm.dbg.value(metadata i8* %1, metadata !72, metadata !DIExpression()), !dbg !76
  call void @llvm.dbg.value(metadata i32 0, metadata !73, metadata !DIExpression()), !dbg !76

!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !{!0, !52}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 81, type: !54, isLocal: false, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !56)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !{!57}
!57 = !DISubrange(count: 4)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !{i32 7, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = !{i32 7, !"frame-pointer", i32 2}
!64 = !{!"Alpine clang version 13.0.1"}
!65 = distinct !DISubprogram(name: "is_suffix", scope: !3, file: !3, line: 17, type: !66, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !70)
!66 = !DISubroutineType(types: !67)
!67 = !{!59, !68, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!70 = !{!71, !72, !73, !74, !75}
!71 = !DILocalVariable(name: "base", arg: 1, scope: !65, file: !3, line: 17, type: !68)
!72 = !DILocalVariable(name: "suf", arg: 2, scope: !65, file: !3, line: 17, type: !68)
!73 = !DILocalVariable(name: "base_end", scope: !65, file: !3, line: 18, type: !59)
!74 = !DILocalVariable(name: "diff", scope: !65, file: !3, line: 26, type: !59)
!75 = !DILocalVariable(name: "i", scope: !65, file: !3, line: 27, type: !59)
!76 = !DILocation(line: 0, scope: !65)
!77 = !DILocation(line: 21, column: 6, scope: !78)
!78 = distinct !DILexicalBlock(scope: !79, file: !3, line: 21, column: 6)
!79 = distinct !DILexicalBlock(scope: !80, file: !3, line: 20, column: 47)
!80 = distinct !DILexicalBlock(scope: !81, file: !3, line: 20, column: 2)
!81 = distinct !DILexicalBlock(scope: !65, file: !3, line: 20, column: 2)
!82 = !{!83, !83, i64 0}
!83 = !{!"omnipotent char", !84, i64 0}
!84 = !{!"Simple C/C++ TBAA"}
!85 = !DILocation(line: 21, column: 21, scope: !78)
!86 = !DILocation(line: 21, column: 6, scope: !79)
!87 = !DILocation(line: 23, column: 5, scope: !65)
!88 = !DILocation(line: 26, column: 22, scope: !65)
!89 = !DILocation(line: 30, column: 6, scope: !90)
!90 = distinct !DILexicalBlock(scope: !91, file: !3, line: 30, column: 6)
!91 = distinct !DILexicalBlock(scope: !92, file: !3, line: 29, column: 16)
!92 = distinct !DILexicalBlock(scope: !93, file: !3, line: 29, column: 2)
!93 = distinct !DILexicalBlock(scope: !65, file: !3, line: 29, column: 2)
!94 = !DILocation(line: 30, column: 16, scope: !90)
!95 = !DILocation(line: 30, column: 13, scope: !90)
!96 = !DILocation(line: 30, column: 6, scope: !91)
!97 = !DILocation(line: 30, column: 22, scope: !90)
!98 = !DILocation(line: 35, column: 1, scope: !65)
!99 = distinct !DISubprogram(name: "xdp_patch_ports_func", scope: !3, file: !3, line: 41, type: !100, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !112)
!100 = !DISubroutineType(types: !101)
!101 = !{!59, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5508, size: 192, elements: !104)
!104 = !{!105, !107, !108, !109, !110, !111}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !6, line: 5509, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !103, file: !6, line: 5510, baseType: !106, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !103, file: !6, line: 5511, baseType: !106, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !103, file: !6, line: 5513, baseType: !106, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !103, file: !6, line: 5514, baseType: !106, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !103, file: !6, line: 5516, baseType: !106, size: 32, offset: 160)
!112 = !{!113, !114, !115, !116, !117, !131, !150, !182, !191, !192, !193, !198}
!113 = !DILocalVariable(name: "ctx", arg: 1, scope: !99, file: !3, line: 41, type: !102)
!114 = !DILocalVariable(name: "action", scope: !99, file: !3, line: 43, type: !59)
!115 = !DILocalVariable(name: "eth_type", scope: !99, file: !3, line: 44, type: !59)
!116 = !DILocalVariable(name: "ip_type", scope: !99, file: !3, line: 44, type: !59)
!117 = !DILocalVariable(name: "eth", scope: !99, file: !3, line: 45, type: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !120, line: 169, size: 112, elements: !121)
!120 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!121 = !{!122, !127, !128}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !119, file: !120, line: 170, baseType: !123, size: 48)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 48, elements: !125)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !{!126}
!126 = !DISubrange(count: 6)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !119, file: !120, line: 171, baseType: !123, size: 48, offset: 48)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !119, file: !120, line: 172, baseType: !129, size: 16, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !130, line: 25, baseType: !48)
!130 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!131 = !DILocalVariable(name: "iphdr", scope: !99, file: !3, line: 46, type: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !134, line: 86, size: 160, elements: !135)
!134 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!135 = !{!136, !138, !139, !140, !141, !142, !143, !144, !145, !147, !149}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !133, file: !134, line: 88, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !124)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !133, file: !134, line: 89, baseType: !137, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !133, file: !134, line: 96, baseType: !137, size: 8, offset: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !133, file: !134, line: 97, baseType: !129, size: 16, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !133, file: !134, line: 98, baseType: !129, size: 16, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !133, file: !134, line: 99, baseType: !129, size: 16, offset: 48)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !133, file: !134, line: 100, baseType: !137, size: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !133, file: !134, line: 101, baseType: !137, size: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !133, file: !134, line: 102, baseType: !146, size: 16, offset: 80)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !130, line: 31, baseType: !48)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !133, file: !134, line: 103, baseType: !148, size: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !130, line: 27, baseType: !106)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !133, file: !134, line: 104, baseType: !148, size: 32, offset: 128)
!150 = !DILocalVariable(name: "ipv6hdr", scope: !99, file: !3, line: 47, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !153, line: 117, size: 320, elements: !154)
!153 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!154 = !{!155, !156, !157, !161, !162, !163, !164, !181}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !152, file: !153, line: 119, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !152, file: !153, line: 120, baseType: !137, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !152, file: !153, line: 127, baseType: !158, size: 24, offset: 8)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 24, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 3)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !152, file: !153, line: 129, baseType: !129, size: 16, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !152, file: !153, line: 130, baseType: !137, size: 8, offset: 48)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !152, file: !153, line: 131, baseType: !137, size: 8, offset: 56)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !152, file: !153, line: 133, baseType: !165, size: 128, offset: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !166, line: 33, size: 128, elements: !167)
!166 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !165, file: !166, line: 40, baseType: !169, size: 128)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !166, line: 34, size: 128, elements: !170)
!170 = !{!171, !175, !179}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !169, file: !166, line: 35, baseType: !172, size: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !169, file: !166, line: 37, baseType: !176, size: 128)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !169, file: !166, line: 38, baseType: !180, size: 128)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 128, elements: !56)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !152, file: !153, line: 134, baseType: !165, size: 128, offset: 192)
!182 = !DILocalVariable(name: "udphdr", scope: !99, file: !3, line: 48, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !185, line: 23, size: 64, elements: !186)
!185 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !184, file: !185, line: 24, baseType: !129, size: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !184, file: !185, line: 25, baseType: !129, size: 16, offset: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !184, file: !185, line: 26, baseType: !129, size: 16, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !184, file: !185, line: 27, baseType: !146, size: 16, offset: 48)
!191 = !DILocalVariable(name: "data_end", scope: !99, file: !3, line: 49, type: !46)
!192 = !DILocalVariable(name: "data", scope: !99, file: !3, line: 50, type: !46)
!193 = !DILocalVariable(name: "nh", scope: !99, file: !3, line: 51, type: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !195, line: 33, size: 64, elements: !196)
!195 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/root/qname_intercepter/xdp-filter")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !194, file: !195, line: 34, baseType: !46, size: 64)
!198 = !DILabel(scope: !99, name: "out", file: !3, line: 77)
!199 = !DILocation(line: 0, scope: !99)
!200 = !DILocation(line: 49, column: 38, scope: !99)
!201 = !{!202, !203, i64 4}
!202 = !{!"xdp_md", !203, i64 0, !203, i64 4, !203, i64 8, !203, i64 12, !203, i64 16, !203, i64 20}
!203 = !{!"int", !83, i64 0}
!204 = !DILocation(line: 49, column: 27, scope: !99)
!205 = !DILocation(line: 49, column: 19, scope: !99)
!206 = !DILocation(line: 50, column: 34, scope: !99)
!207 = !{!202, !203, i64 0}
!208 = !DILocation(line: 50, column: 23, scope: !99)
!209 = !DILocation(line: 50, column: 15, scope: !99)
!210 = !DILocalVariable(name: "nh", arg: 1, scope: !211, file: !195, line: 124, type: !214)
!211 = distinct !DISubprogram(name: "parse_ethhdr", scope: !195, file: !195, line: 124, type: !212, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !216)
!212 = !DISubroutineType(types: !213)
!213 = !{!59, !214, !46, !215}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!216 = !{!210, !217, !218}
!217 = !DILocalVariable(name: "data_end", arg: 2, scope: !211, file: !195, line: 125, type: !46)
!218 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !211, file: !195, line: 126, type: !215)
!219 = !DILocation(line: 0, scope: !211, inlinedAt: !220)
!220 = distinct !DILocation(line: 53, column: 13, scope: !99)
!221 = !DILocalVariable(name: "nh", arg: 1, scope: !222, file: !195, line: 79, type: !214)
!222 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !195, file: !195, line: 79, type: !223, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !232)
!223 = !DISubroutineType(types: !224)
!224 = !{!59, !214, !46, !215, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !195, line: 64, size: 32, elements: !227)
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !226, file: !195, line: 65, baseType: !229, size: 32)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 2)
!232 = !{!221, !233, !234, !235, !236, !237, !238, !244, !245}
!233 = !DILocalVariable(name: "data_end", arg: 2, scope: !222, file: !195, line: 80, type: !46)
!234 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !222, file: !195, line: 81, type: !215)
!235 = !DILocalVariable(name: "vlans", arg: 4, scope: !222, file: !195, line: 82, type: !225)
!236 = !DILocalVariable(name: "eth", scope: !222, file: !195, line: 84, type: !118)
!237 = !DILocalVariable(name: "hdrsize", scope: !222, file: !195, line: 85, type: !59)
!238 = !DILocalVariable(name: "vlh", scope: !222, file: !195, line: 86, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !195, line: 42, size: 32, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !240, file: !195, line: 43, baseType: !129, size: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !240, file: !195, line: 44, baseType: !129, size: 16, offset: 16)
!244 = !DILocalVariable(name: "h_proto", scope: !222, file: !195, line: 87, type: !48)
!245 = !DILocalVariable(name: "i", scope: !222, file: !195, line: 88, type: !59)
!246 = !DILocation(line: 0, scope: !222, inlinedAt: !247)
!247 = distinct !DILocation(line: 129, column: 9, scope: !211, inlinedAt: !220)
!248 = !DILocation(line: 93, column: 14, scope: !249, inlinedAt: !247)
!249 = distinct !DILexicalBlock(scope: !222, file: !195, line: 93, column: 6)
!250 = !DILocation(line: 93, column: 24, scope: !249, inlinedAt: !247)
!251 = !DILocation(line: 93, column: 6, scope: !222, inlinedAt: !247)
!252 = !DILocation(line: 99, column: 17, scope: !222, inlinedAt: !247)
!253 = !{!254, !254, i64 0}
!254 = !{!"short", !83, i64 0}
!255 = !DILocalVariable(name: "h_proto", arg: 1, scope: !256, file: !195, line: 68, type: !48)
!256 = distinct !DISubprogram(name: "proto_is_vlan", scope: !195, file: !195, line: 68, type: !257, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{!59, !48}
!259 = !{!255}
!260 = !DILocation(line: 0, scope: !256, inlinedAt: !261)
!261 = distinct !DILocation(line: 106, column: 8, scope: !262, inlinedAt: !247)
!262 = distinct !DILexicalBlock(scope: !263, file: !195, line: 106, column: 7)
!263 = distinct !DILexicalBlock(scope: !264, file: !195, line: 105, column: 39)
!264 = distinct !DILexicalBlock(scope: !265, file: !195, line: 105, column: 2)
!265 = distinct !DILexicalBlock(scope: !222, file: !195, line: 105, column: 2)
!266 = !DILocation(line: 70, column: 20, scope: !256, inlinedAt: !261)
!267 = !DILocation(line: 70, column: 46, scope: !256, inlinedAt: !261)
!268 = !DILocation(line: 106, column: 7, scope: !263, inlinedAt: !247)
!269 = !DILocation(line: 109, column: 11, scope: !270, inlinedAt: !247)
!270 = distinct !DILexicalBlock(scope: !263, file: !195, line: 109, column: 7)
!271 = !DILocation(line: 109, column: 15, scope: !270, inlinedAt: !247)
!272 = !DILocation(line: 109, column: 7, scope: !263, inlinedAt: !247)
!273 = !DILocation(line: 112, column: 18, scope: !263, inlinedAt: !247)
!274 = !DILocation(line: 59, column: 6, scope: !99)
!275 = !DILocalVariable(name: "nh", arg: 1, scope: !276, file: !195, line: 151, type: !214)
!276 = distinct !DISubprogram(name: "parse_iphdr", scope: !195, file: !195, line: 151, type: !277, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !280)
!277 = !DISubroutineType(types: !278)
!278 = !{!59, !214, !46, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!280 = !{!275, !281, !282, !283, !284}
!281 = !DILocalVariable(name: "data_end", arg: 2, scope: !276, file: !195, line: 152, type: !46)
!282 = !DILocalVariable(name: "iphdr", arg: 3, scope: !276, file: !195, line: 153, type: !279)
!283 = !DILocalVariable(name: "iph", scope: !276, file: !195, line: 155, type: !132)
!284 = !DILocalVariable(name: "hdrsize", scope: !276, file: !195, line: 156, type: !59)
!285 = !DILocation(line: 0, scope: !276, inlinedAt: !286)
!286 = distinct !DILocation(line: 60, column: 13, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !3, line: 59, column: 39)
!288 = distinct !DILexicalBlock(scope: !99, file: !3, line: 59, column: 6)
!289 = !DILocation(line: 158, column: 10, scope: !290, inlinedAt: !286)
!290 = distinct !DILexicalBlock(scope: !276, file: !195, line: 158, column: 6)
!291 = !DILocation(line: 158, column: 14, scope: !290, inlinedAt: !286)
!292 = !DILocation(line: 158, column: 6, scope: !276, inlinedAt: !286)
!293 = !DILocation(line: 161, column: 17, scope: !276, inlinedAt: !286)
!294 = !DILocation(line: 161, column: 21, scope: !276, inlinedAt: !286)
