; ModuleID = 'xdp_pass_kern.c'
source_filename = "xdp_pass_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [11 x i32]*, %struct.qname_lpm_key*, i32*, [1 x i32]*, [255 x i32]* }
%struct.qname_lpm_key = type { i32, [64 x i8] }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.udphdr = type { i16, i16, i16, i16 }

@dns_block_suffixes = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !0
@__const.xdp_patch_ports_func.____fmt = private unnamed_addr constant [19 x i8] c"blocked prefix: %d\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !58
@__const.get_qname_lpm_key.____fmt = private unnamed_addr constant [11 x i8] c"dm len:%d\0A\00", align 1
@__const.get_qname_lpm_key.____fmt.1 = private unnamed_addr constant [15 x i8] c"rev suffix:%s\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dns_block_suffixes", scope: !2, file: !3, line: 33, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Alpine clang version 13.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !57, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_pass_kern.c", directory: "/root/qname_intercepter/xdp-filter")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5497, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51, !54, !55}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !{!58, !0, !63, !71}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 144, type: !60, isLocal: false, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 32, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 4)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !65, line: 33, type: !66, isLocal: true, isDefinition: true)
!65 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/root/qname_intercepter/xdp-filter")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!46, !46, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !65, line: 152, type: !73, isLocal: true, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !77, !79, null}
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 27, size: 320, elements: !81)
!81 = !{!82, !87, !96, !98, !103}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !3, line: 28, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 352, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 11)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !80, file: !3, line: 29, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qname_lpm_key", file: !3, line: 22, size: 544, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !89, file: !3, line: 23, baseType: !79, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rev_suf", scope: !89, file: !3, line: 24, baseType: !93, size: 512, offset: 32)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 512, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !80, file: !3, line: 30, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !3, line: 31, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 1)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !3, line: 32, baseType: !104, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 255)
!108 = !{i32 7, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{i32 7, !"frame-pointer", i32 2}
!112 = !{!"Alpine clang version 13.0.1"}
!113 = distinct !DISubprogram(name: "xdp_patch_ports_func", scope: !3, file: !3, line: 83, type: !114, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !125)
!114 = !DISubroutineType(types: !115)
!115 = !{!76, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5508, size: 192, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !6, line: 5509, baseType: !79, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !117, file: !6, line: 5510, baseType: !79, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !117, file: !6, line: 5511, baseType: !79, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !117, file: !6, line: 5513, baseType: !79, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !117, file: !6, line: 5514, baseType: !79, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !117, file: !6, line: 5516, baseType: !79, size: 32, offset: 160)
!125 = !{!126, !127, !128, !129, !130, !143, !161, !193, !202, !203, !204, !209, !212, !213, !216, !217, !224}
!126 = !DILocalVariable(name: "ctx", arg: 1, scope: !113, file: !3, line: 83, type: !116)
!127 = !DILocalVariable(name: "action", scope: !113, file: !3, line: 85, type: !76)
!128 = !DILocalVariable(name: "eth_type", scope: !113, file: !3, line: 86, type: !76)
!129 = !DILocalVariable(name: "ip_type", scope: !113, file: !3, line: 86, type: !76)
!130 = !DILocalVariable(name: "eth", scope: !113, file: !3, line: 87, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !133, line: 169, size: 112, elements: !134)
!133 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!134 = !{!135, !139, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !132, file: !133, line: 170, baseType: !136, size: 48)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 6)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !132, file: !133, line: 171, baseType: !136, size: 48, offset: 48)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !132, file: !133, line: 172, baseType: !141, size: 16, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !142, line: 25, baseType: !48)
!142 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!143 = !DILocalVariable(name: "iphdr", scope: !113, file: !3, line: 88, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !146, line: 86, size: 160, elements: !147)
!146 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !158, !160}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !145, file: !146, line: 88, baseType: !52, size: 4, flags: DIFlagBitField, extraData: i64 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !145, file: !146, line: 89, baseType: !52, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !145, file: !146, line: 96, baseType: !52, size: 8, offset: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !145, file: !146, line: 97, baseType: !141, size: 16, offset: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !146, line: 98, baseType: !141, size: 16, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !145, file: !146, line: 99, baseType: !141, size: 16, offset: 48)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !145, file: !146, line: 100, baseType: !52, size: 8, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !145, file: !146, line: 101, baseType: !52, size: 8, offset: 72)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !145, file: !146, line: 102, baseType: !157, size: 16, offset: 80)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !142, line: 31, baseType: !48)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !145, file: !146, line: 103, baseType: !159, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !142, line: 27, baseType: !79)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !145, file: !146, line: 104, baseType: !159, size: 32, offset: 128)
!161 = !DILocalVariable(name: "ipv6hdr", scope: !113, file: !3, line: 89, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !164, line: 117, size: 320, elements: !165)
!164 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!165 = !{!166, !167, !168, !172, !173, !174, !175, !192}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !163, file: !164, line: 119, baseType: !52, size: 4, flags: DIFlagBitField, extraData: i64 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !163, file: !164, line: 120, baseType: !52, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !163, file: !164, line: 127, baseType: !169, size: 24, offset: 8)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 3)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !163, file: !164, line: 129, baseType: !141, size: 16, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !163, file: !164, line: 130, baseType: !52, size: 8, offset: 48)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !163, file: !164, line: 131, baseType: !52, size: 8, offset: 56)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !163, file: !164, line: 133, baseType: !176, size: 128, offset: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !177, line: 33, size: 128, elements: !178)
!177 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !176, file: !177, line: 40, baseType: !180, size: 128)
!180 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !176, file: !177, line: 34, size: 128, elements: !181)
!181 = !{!182, !186, !190}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !180, file: !177, line: 35, baseType: !183, size: 128)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !180, file: !177, line: 37, baseType: !187, size: 128)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !180, file: !177, line: 38, baseType: !191, size: 128)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 128, elements: !61)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !163, file: !164, line: 134, baseType: !176, size: 128, offset: 192)
!193 = !DILocalVariable(name: "udphdr", scope: !113, file: !3, line: 90, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !196, line: 23, size: 64, elements: !197)
!196 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !195, file: !196, line: 24, baseType: !141, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !195, file: !196, line: 25, baseType: !141, size: 16, offset: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !195, file: !196, line: 26, baseType: !141, size: 16, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !195, file: !196, line: 27, baseType: !157, size: 16, offset: 48)
!202 = !DILocalVariable(name: "data_end", scope: !113, file: !3, line: 91, type: !46)
!203 = !DILocalVariable(name: "data", scope: !113, file: !3, line: 92, type: !46)
!204 = !DILocalVariable(name: "nh", scope: !113, file: !3, line: 93, type: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !206, line: 33, size: 64, elements: !207)
!206 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/root/qname_intercepter/xdp-filter")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !205, file: !206, line: 34, baseType: !46, size: 64)
!209 = !DILocalVariable(name: "udppld", scope: !210, file: !3, line: 110, type: !79)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 109, column: 30)
!211 = distinct !DILexicalBlock(scope: !113, file: !3, line: 109, column: 6)
!212 = !DILocalVariable(name: "qrn", scope: !210, file: !3, line: 119, type: !48)
!213 = !DILocalVariable(name: "qlk", scope: !214, file: !3, line: 121, type: !89)
!214 = distinct !DILexicalBlock(scope: !215, file: !3, line: 120, column: 14)
!215 = distinct !DILexicalBlock(scope: !210, file: !3, line: 120, column: 6)
!216 = !DILocalVariable(name: "tval", scope: !214, file: !3, line: 126, type: !97)
!217 = !DILocalVariable(name: "____fmt", scope: !218, file: !3, line: 131, type: !221)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 131, column: 5)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 130, column: 9)
!220 = distinct !DILexicalBlock(scope: !214, file: !3, line: 127, column: 7)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 152, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 19)
!224 = !DILabel(scope: !113, name: "out", file: !3, line: 140)
!225 = !DILocation(line: 0, scope: !113)
!226 = !DILocation(line: 91, column: 38, scope: !113)
!227 = !{!228, !229, i64 4}
!228 = !{!"xdp_md", !229, i64 0, !229, i64 4, !229, i64 8, !229, i64 12, !229, i64 16, !229, i64 20}
!229 = !{!"int", !230, i64 0}
!230 = !{!"omnipotent char", !231, i64 0}
!231 = !{!"Simple C/C++ TBAA"}
!232 = !DILocation(line: 91, column: 27, scope: !113)
!233 = !DILocation(line: 91, column: 19, scope: !113)
!234 = !DILocation(line: 92, column: 34, scope: !113)
!235 = !{!228, !229, i64 0}
!236 = !DILocation(line: 92, column: 23, scope: !113)
!237 = !DILocation(line: 92, column: 15, scope: !113)
!238 = !DILocalVariable(name: "nh", arg: 1, scope: !239, file: !206, line: 124, type: !242)
!239 = distinct !DISubprogram(name: "parse_ethhdr", scope: !206, file: !206, line: 124, type: !240, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !244)
!240 = !DISubroutineType(types: !241)
!241 = !{!76, !242, !46, !243}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!244 = !{!238, !245, !246}
!245 = !DILocalVariable(name: "data_end", arg: 2, scope: !239, file: !206, line: 125, type: !46)
!246 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !239, file: !206, line: 126, type: !243)
!247 = !DILocation(line: 0, scope: !239, inlinedAt: !248)
!248 = distinct !DILocation(line: 95, column: 13, scope: !113)
!249 = !DILocalVariable(name: "nh", arg: 1, scope: !250, file: !206, line: 79, type: !242)
!250 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !206, file: !206, line: 79, type: !251, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!251 = !DISubroutineType(types: !252)
!252 = !{!76, !242, !46, !243, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !206, line: 64, size: 32, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !254, file: !206, line: 65, baseType: !257, size: 32)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 2)
!260 = !{!249, !261, !262, !263, !264, !265, !266, !272, !273}
!261 = !DILocalVariable(name: "data_end", arg: 2, scope: !250, file: !206, line: 80, type: !46)
!262 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !250, file: !206, line: 81, type: !243)
!263 = !DILocalVariable(name: "vlans", arg: 4, scope: !250, file: !206, line: 82, type: !253)
!264 = !DILocalVariable(name: "eth", scope: !250, file: !206, line: 84, type: !131)
!265 = !DILocalVariable(name: "hdrsize", scope: !250, file: !206, line: 85, type: !76)
!266 = !DILocalVariable(name: "vlh", scope: !250, file: !206, line: 86, type: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !206, line: 42, size: 32, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !268, file: !206, line: 43, baseType: !141, size: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !268, file: !206, line: 44, baseType: !141, size: 16, offset: 16)
!272 = !DILocalVariable(name: "h_proto", scope: !250, file: !206, line: 87, type: !48)
!273 = !DILocalVariable(name: "i", scope: !250, file: !206, line: 88, type: !76)
!274 = !DILocation(line: 0, scope: !250, inlinedAt: !275)
!275 = distinct !DILocation(line: 129, column: 9, scope: !239, inlinedAt: !248)
!276 = !DILocation(line: 93, column: 14, scope: !277, inlinedAt: !275)
!277 = distinct !DILexicalBlock(scope: !250, file: !206, line: 93, column: 6)
!278 = !DILocation(line: 93, column: 24, scope: !277, inlinedAt: !275)
!279 = !DILocation(line: 93, column: 6, scope: !250, inlinedAt: !275)
!280 = !DILocation(line: 99, column: 17, scope: !250, inlinedAt: !275)
!281 = !{!282, !282, i64 0}
!282 = !{!"short", !230, i64 0}
!283 = !DILocalVariable(name: "h_proto", arg: 1, scope: !284, file: !206, line: 68, type: !48)
!284 = distinct !DISubprogram(name: "proto_is_vlan", scope: !206, file: !206, line: 68, type: !285, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!76, !48}
!287 = !{!283}
!288 = !DILocation(line: 0, scope: !284, inlinedAt: !289)
!289 = distinct !DILocation(line: 106, column: 8, scope: !290, inlinedAt: !275)
!290 = distinct !DILexicalBlock(scope: !291, file: !206, line: 106, column: 7)
!291 = distinct !DILexicalBlock(scope: !292, file: !206, line: 105, column: 39)
!292 = distinct !DILexicalBlock(scope: !293, file: !206, line: 105, column: 2)
!293 = distinct !DILexicalBlock(scope: !250, file: !206, line: 105, column: 2)
!294 = !DILocation(line: 70, column: 20, scope: !284, inlinedAt: !289)
!295 = !DILocation(line: 70, column: 46, scope: !284, inlinedAt: !289)
!296 = !DILocation(line: 106, column: 7, scope: !291, inlinedAt: !275)
!297 = !DILocation(line: 109, column: 11, scope: !298, inlinedAt: !275)
!298 = distinct !DILexicalBlock(scope: !291, file: !206, line: 109, column: 7)
!299 = !DILocation(line: 109, column: 15, scope: !298, inlinedAt: !275)
!300 = !DILocation(line: 109, column: 7, scope: !291, inlinedAt: !275)
!301 = !DILocation(line: 112, column: 18, scope: !291, inlinedAt: !275)
!302 = !DILocation(line: 101, column: 6, scope: !113)
!303 = !DILocalVariable(name: "nh", arg: 1, scope: !304, file: !206, line: 151, type: !242)
!304 = distinct !DISubprogram(name: "parse_iphdr", scope: !206, file: !206, line: 151, type: !305, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !308)
!305 = !DISubroutineType(types: !306)
!306 = !{!76, !242, !46, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!308 = !{!303, !309, !310, !311, !312}
!309 = !DILocalVariable(name: "data_end", arg: 2, scope: !304, file: !206, line: 152, type: !46)
!310 = !DILocalVariable(name: "iphdr", arg: 3, scope: !304, file: !206, line: 153, type: !307)
!311 = !DILocalVariable(name: "iph", scope: !304, file: !206, line: 155, type: !144)
!312 = !DILocalVariable(name: "hdrsize", scope: !304, file: !206, line: 156, type: !76)
!313 = !DILocation(line: 0, scope: !304, inlinedAt: !314)
!314 = distinct !DILocation(line: 102, column: 13, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !3, line: 101, column: 39)
!316 = distinct !DILexicalBlock(scope: !113, file: !3, line: 101, column: 6)
!317 = !DILocation(line: 158, column: 10, scope: !318, inlinedAt: !314)
!318 = distinct !DILexicalBlock(scope: !304, file: !206, line: 158, column: 6)
!319 = !DILocation(line: 158, column: 14, scope: !318, inlinedAt: !314)
!320 = !DILocation(line: 158, column: 6, scope: !304, inlinedAt: !314)
!321 = !DILocation(line: 161, column: 17, scope: !304, inlinedAt: !314)
!322 = !DILocation(line: 161, column: 21, scope: !304, inlinedAt: !314)
