; ModuleID = 'xdp_pass_kern.c'
source_filename = "xdp_pass_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [11 x i32]*, %struct.qname_lpm_key*, i32*, [1 x i32]*, [255 x i32]* }
%struct.qname_lpm_key = type { i32, [64 x i8] }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.udphdr = type { i16, i16, i16, i16 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@dns_block_suffixes = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !58
@__const.get_qname_lpm_key.____fmt = private unnamed_addr constant [15 x i8] c"rev suffix:%s\0A\00", align 1
@__const.get_qname_lpm_key.____fmt.1 = private unnamed_addr constant [10 x i8] c"q len:%d\0A\00", align 1
@llvm.compiler.used = appending global [3 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.anon* @dns_block_suffixes to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_patch_ports_func to i8*)], section "llvm.metadata"

; Function Attrs: nounwind

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 161, type: !98, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Alpine clang version 13.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !57, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_pass_kern.c", directory: "/root/qname_intercepter/xdp-filter")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5497, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51, !54, !55}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !{!0, !58, !90}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "dns_block_suffixes", scope: !2, file: !3, line: 36, type: !60, isLocal: false, isDefinition: true)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 320, elements: !61)
!61 = !{!62, !68, !78, !80, !85}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !3, line: 31, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 352, elements: !66)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !{!67}
!67 = !DISubrange(count: 11)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !60, file: !3, line: 32, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qname_lpm_key", file: !3, line: 25, size: 544, elements: !71)
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !70, file: !3, line: 26, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rev_suf", scope: !70, file: !3, line: 27, baseType: !75, size: 512, offset: 32)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 512, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !60, file: !3, line: 33, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !60, file: !3, line: 34, baseType: !81, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !60, file: !3, line: 35, baseType: !86, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8160, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 255)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !92, line: 152, type: !93, isLocal: true, isDefinition: true)
!92 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/root/qname_intercepter/xdp-filter")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!65, !96, !73, null}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 32, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 4)
!101 = !{i32 7, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{i32 1, !"wchar_size", i32 4}
!104 = !{i32 7, !"frame-pointer", i32 2}
!105 = !{!"Alpine clang version 13.0.1"}
!106 = distinct !DISubprogram(name: "xdp_patch_ports_func", scope: !3, file: !3, line: 113, type: !107, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !118)
!107 = !DISubroutineType(types: !108)
!108 = !{!65, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5508, size: 192, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !110, file: !6, line: 5509, baseType: !73, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !110, file: !6, line: 5510, baseType: !73, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !110, file: !6, line: 5511, baseType: !73, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !110, file: !6, line: 5513, baseType: !73, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !110, file: !6, line: 5514, baseType: !73, size: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !110, file: !6, line: 5516, baseType: !73, size: 32, offset: 160)
!118 = !{!119, !120, !121, !122, !123, !136, !154, !186, !195, !196, !197, !202, !205, !206}
!119 = !DILocalVariable(name: "ctx", arg: 1, scope: !106, file: !3, line: 113, type: !109)
!120 = !DILocalVariable(name: "action", scope: !106, file: !3, line: 115, type: !65)
!121 = !DILocalVariable(name: "eth_type", scope: !106, file: !3, line: 116, type: !65)
!122 = !DILocalVariable(name: "ip_type", scope: !106, file: !3, line: 116, type: !65)
!123 = !DILocalVariable(name: "eth", scope: !106, file: !3, line: 117, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !126, line: 169, size: 112, elements: !127)
!126 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!127 = !{!128, !132, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !125, file: !126, line: 170, baseType: !129, size: 48)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 6)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !125, file: !126, line: 171, baseType: !129, size: 48, offset: 48)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !125, file: !126, line: 172, baseType: !134, size: 16, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !135, line: 25, baseType: !48)
!135 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!136 = !DILocalVariable(name: "iphdr", scope: !106, file: !3, line: 118, type: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !139, line: 86, size: 160, elements: !140)
!139 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !151, !153}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !138, file: !139, line: 88, baseType: !52, size: 4, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !138, file: !139, line: 89, baseType: !52, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !138, file: !139, line: 96, baseType: !52, size: 8, offset: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !138, file: !139, line: 97, baseType: !134, size: 16, offset: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !139, line: 98, baseType: !134, size: 16, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !138, file: !139, line: 99, baseType: !134, size: 16, offset: 48)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !138, file: !139, line: 100, baseType: !52, size: 8, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !138, file: !139, line: 101, baseType: !52, size: 8, offset: 72)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !138, file: !139, line: 102, baseType: !150, size: 16, offset: 80)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !135, line: 31, baseType: !48)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !138, file: !139, line: 103, baseType: !152, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !135, line: 27, baseType: !73)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !138, file: !139, line: 104, baseType: !152, size: 32, offset: 128)
!154 = !DILocalVariable(name: "ipv6hdr", scope: !106, file: !3, line: 119, type: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !157, line: 117, size: 320, elements: !158)
!157 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!158 = !{!159, !160, !161, !165, !166, !167, !168, !185}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !156, file: !157, line: 119, baseType: !52, size: 4, flags: DIFlagBitField, extraData: i64 0)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !156, file: !157, line: 120, baseType: !52, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !156, file: !157, line: 127, baseType: !162, size: 24, offset: 8)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 3)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !156, file: !157, line: 129, baseType: !134, size: 16, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !156, file: !157, line: 130, baseType: !52, size: 8, offset: 48)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !156, file: !157, line: 131, baseType: !52, size: 8, offset: 56)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !156, file: !157, line: 133, baseType: !169, size: 128, offset: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !170, line: 33, size: 128, elements: !171)
!170 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !169, file: !170, line: 40, baseType: !173, size: 128)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 34, size: 128, elements: !174)
!174 = !{!175, !179, !183}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !173, file: !170, line: 35, baseType: !176, size: 128)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !173, file: !170, line: 37, baseType: !180, size: 128)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 128, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !173, file: !170, line: 38, baseType: !184, size: 128)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !99)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !156, file: !157, line: 134, baseType: !169, size: 128, offset: 192)
!186 = !DILocalVariable(name: "udphdr", scope: !106, file: !3, line: 120, type: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !189, line: 23, size: 64, elements: !190)
!189 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !188, file: !189, line: 24, baseType: !134, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !188, file: !189, line: 25, baseType: !134, size: 16, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !188, file: !189, line: 26, baseType: !134, size: 16, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !188, file: !189, line: 27, baseType: !150, size: 16, offset: 48)
!195 = !DILocalVariable(name: "data_end", scope: !106, file: !3, line: 121, type: !46)
!196 = !DILocalVariable(name: "data", scope: !106, file: !3, line: 122, type: !46)
!197 = !DILocalVariable(name: "nh", scope: !106, file: !3, line: 123, type: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !199, line: 33, size: 64, elements: !200)
!199 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/root/qname_intercepter/xdp-filter")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !198, file: !199, line: 34, baseType: !46, size: 64)
!202 = !DILocalVariable(name: "udppld", scope: !203, file: !3, line: 140, type: !73)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 139, column: 30)
!204 = distinct !DILexicalBlock(scope: !106, file: !3, line: 139, column: 6)
!205 = !DILocalVariable(name: "qrn", scope: !203, file: !3, line: 149, type: !48)
!206 = !DILabel(scope: !106, name: "out", file: !3, line: 157)
!207 = !DILocation(line: 0, scope: !106)
!208 = !DILocation(line: 121, column: 38, scope: !106)
!209 = !{!210, !211, i64 4}
!210 = !{!"xdp_md", !211, i64 0, !211, i64 4, !211, i64 8, !211, i64 12, !211, i64 16, !211, i64 20}
!211 = !{!"int", !212, i64 0}
!212 = !{!"omnipotent char", !213, i64 0}
!213 = !{!"Simple C/C++ TBAA"}
!214 = !DILocation(line: 121, column: 27, scope: !106)
!215 = !DILocation(line: 121, column: 19, scope: !106)
!216 = !DILocation(line: 122, column: 34, scope: !106)
!217 = !{!210, !211, i64 0}
!218 = !DILocation(line: 122, column: 23, scope: !106)
!219 = !DILocation(line: 122, column: 15, scope: !106)
!220 = !DILocalVariable(name: "nh", arg: 1, scope: !221, file: !199, line: 124, type: !224)
!221 = distinct !DISubprogram(name: "parse_ethhdr", scope: !199, file: !199, line: 124, type: !222, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!222 = !DISubroutineType(types: !223)
!223 = !{!65, !224, !46, !225}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!226 = !{!220, !227, !228}
!227 = !DILocalVariable(name: "data_end", arg: 2, scope: !221, file: !199, line: 125, type: !46)
!228 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !221, file: !199, line: 126, type: !225)
!229 = !DILocation(line: 0, scope: !221, inlinedAt: !230)
!230 = distinct !DILocation(line: 125, column: 13, scope: !106)
!231 = !DILocalVariable(name: "nh", arg: 1, scope: !232, file: !199, line: 79, type: !224)
!232 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !199, file: !199, line: 79, type: !233, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !242)
!233 = !DISubroutineType(types: !234)
!234 = !{!65, !224, !46, !225, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !199, line: 64, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !236, file: !199, line: 65, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 2)
!242 = !{!231, !243, !244, !245, !246, !247, !248, !254, !255}
!243 = !DILocalVariable(name: "data_end", arg: 2, scope: !232, file: !199, line: 80, type: !46)
!244 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !232, file: !199, line: 81, type: !225)
!245 = !DILocalVariable(name: "vlans", arg: 4, scope: !232, file: !199, line: 82, type: !235)
!246 = !DILocalVariable(name: "eth", scope: !232, file: !199, line: 84, type: !124)
!247 = !DILocalVariable(name: "hdrsize", scope: !232, file: !199, line: 85, type: !65)
!248 = !DILocalVariable(name: "vlh", scope: !232, file: !199, line: 86, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !199, line: 42, size: 32, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !250, file: !199, line: 43, baseType: !134, size: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !250, file: !199, line: 44, baseType: !134, size: 16, offset: 16)
!254 = !DILocalVariable(name: "h_proto", scope: !232, file: !199, line: 87, type: !48)
!255 = !DILocalVariable(name: "i", scope: !232, file: !199, line: 88, type: !65)
!256 = !DILocation(line: 0, scope: !232, inlinedAt: !257)
!257 = distinct !DILocation(line: 129, column: 9, scope: !221, inlinedAt: !230)
!258 = !DILocation(line: 93, column: 14, scope: !259, inlinedAt: !257)
!259 = distinct !DILexicalBlock(scope: !232, file: !199, line: 93, column: 6)
!260 = !DILocation(line: 93, column: 24, scope: !259, inlinedAt: !257)
!261 = !DILocation(line: 93, column: 6, scope: !232, inlinedAt: !257)
!262 = !DILocation(line: 99, column: 17, scope: !232, inlinedAt: !257)
!263 = !{!264, !264, i64 0}
!264 = !{!"short", !212, i64 0}
!265 = !DILocalVariable(name: "h_proto", arg: 1, scope: !266, file: !199, line: 68, type: !48)
!266 = distinct !DISubprogram(name: "proto_is_vlan", scope: !199, file: !199, line: 68, type: !267, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!65, !48}
!269 = !{!265}
!270 = !DILocation(line: 0, scope: !266, inlinedAt: !271)
!271 = distinct !DILocation(line: 106, column: 8, scope: !272, inlinedAt: !257)
!272 = distinct !DILexicalBlock(scope: !273, file: !199, line: 106, column: 7)
!273 = distinct !DILexicalBlock(scope: !274, file: !199, line: 105, column: 39)
!274 = distinct !DILexicalBlock(scope: !275, file: !199, line: 105, column: 2)
!275 = distinct !DILexicalBlock(scope: !232, file: !199, line: 105, column: 2)
!276 = !DILocation(line: 70, column: 20, scope: !266, inlinedAt: !271)
!277 = !DILocation(line: 70, column: 46, scope: !266, inlinedAt: !271)
!278 = !DILocation(line: 106, column: 7, scope: !273, inlinedAt: !257)
!279 = !DILocation(line: 109, column: 11, scope: !280, inlinedAt: !257)
!280 = distinct !DILexicalBlock(scope: !273, file: !199, line: 109, column: 7)
!281 = !DILocation(line: 109, column: 15, scope: !280, inlinedAt: !257)
!282 = !DILocation(line: 109, column: 7, scope: !273, inlinedAt: !257)
!283 = !DILocation(line: 112, column: 18, scope: !273, inlinedAt: !257)
!284 = !DILocation(line: 131, column: 6, scope: !106)
!285 = !DILocalVariable(name: "nh", arg: 1, scope: !286, file: !199, line: 151, type: !224)
!286 = distinct !DISubprogram(name: "parse_iphdr", scope: !199, file: !199, line: 151, type: !287, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!287 = !DISubroutineType(types: !288)
!288 = !{!65, !224, !46, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!290 = !{!285, !291, !292, !293, !294}
!291 = !DILocalVariable(name: "data_end", arg: 2, scope: !286, file: !199, line: 152, type: !46)
!292 = !DILocalVariable(name: "iphdr", arg: 3, scope: !286, file: !199, line: 153, type: !289)
!293 = !DILocalVariable(name: "iph", scope: !286, file: !199, line: 155, type: !137)
!294 = !DILocalVariable(name: "hdrsize", scope: !286, file: !199, line: 156, type: !65)
!295 = !DILocation(line: 0, scope: !286, inlinedAt: !296)
!296 = distinct !DILocation(line: 132, column: 13, scope: !297)
!297 = distinct !DILexicalBlock(scope: !298, file: !3, line: 131, column: 39)
!298 = distinct !DILexicalBlock(scope: !106, file: !3, line: 131, column: 6)
!299 = !DILocation(line: 158, column: 10, scope: !300, inlinedAt: !296)
!300 = distinct !DILexicalBlock(scope: !286, file: !199, line: 158, column: 6)
!301 = !DILocation(line: 158, column: 14, scope: !300, inlinedAt: !296)
!302 = !DILocation(line: 158, column: 6, scope: !286, inlinedAt: !296)
!303 = !DILocation(line: 161, column: 17, scope: !286, inlinedAt: !296)
!304 = !DILocation(line: 161, column: 21, scope: !286, inlinedAt: !296)
