; ModuleID = 'qn.c'
source_filename = "qn.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.1 = type { [11 x i32]*, %struct.qname_lpm_key*, %struct.qname_lpm_key*, [1 x i32]*, [1023 x i32]* }
%struct.qname_lpm_key = type { i32, [64 x i8] }
%struct.anon.2 = type { [2 x i32]*, i32*, i64*, [2 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.udphdr = type { i16, i16, i16, i16 }

@xdp_patch_ports_func.____fmt = internal constant [8 x i8] c"rev %s\0A\00", align 1, !dbg !0
@main_map = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !87
@xdp_patch_ports_func.____fmt.1 = internal constant [12 x i8] c"k index %d\0A\00", align 1, !dbg !71
@xdp_patch_ports_func.____fmt.2 = internal constant [16 x i8] c"matched len %d\0A\00", align 1, !dbg !77
@stats_map = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !116
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !82

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 150, type: !229, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "xdp_patch_ports_func", scope: !3, file: !3, line: 83, type: !4, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !151)
!3 = !DIFile(filename: "qn.c", directory: "/root/anti-ddos-firewall/qname_filter", checksumkind: CSK_MD5, checksum: "8b180f3173b36b1937b3f8c2b6f9b132")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !9, line: 2856, size: 160, elements: !10)
!9 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/root/anti-ddos-firewall/qname_filter", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!10 = !{!11, !15, !16, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 2857, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 2858, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 2859, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 2861, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !8, file: !9, line: 2862, baseType: !12, size: 32, offset: 128)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !20, retainedTypes: !59, globals: !70, splitDebugInlining: false, nameTableKind: None)
!20 = !{!21, !28}
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !9, line: 2845, baseType: !14, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26, !27}
!23 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!24 = !DIEnumerator(name: "XDP_DROP", value: 1)
!25 = !DIEnumerator(name: "XDP_PASS", value: 2)
!26 = !DIEnumerator(name: "XDP_TX", value: 3)
!27 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 28, baseType: !14, size: 32, elements: !30)
!29 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9a7f04155c254fef1b7ada5eb82c984c")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!31 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!32 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!33 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!34 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!35 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!36 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!37 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!38 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!39 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!40 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!41 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!42 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!43 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!44 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!45 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!46 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!47 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!48 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!49 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!50 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!51 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!52 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!53 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!54 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!55 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!56 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!57 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!58 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!59 = !{!60, !61, !62, !64, !67, !68}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !63)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !66)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !{!0, !71, !77, !82, !87, !116, !132, !139, !146}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 156, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 96, elements: !75)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!75 = !{!76}
!76 = !DISubrange(count: 12)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 160, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 16)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "_license", scope: !19, file: !3, line: 186, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 32, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 4)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "main_map", scope: !19, file: !3, line: 28, type: !89, isLocal: false, isDefinition: true)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 22, size: 320, elements: !90)
!90 = !{!91, !96, !105, !106, !111}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !3, line: 23, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 352, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 11)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !89, file: !3, line: 24, baseType: !97, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qname_lpm_key", file: !3, line: 17, size: 544, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !98, file: !3, line: 18, baseType: !12, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rev_suf", scope: !98, file: !3, line: 19, baseType: !102, size: 512, offset: 32)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !89, file: !3, line: 25, baseType: !97, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !89, file: !3, line: 26, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !89, file: !3, line: 27, baseType: !112, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32736, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1023)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "stats_map", scope: !19, file: !3, line: 35, type: !118, isLocal: false, isDefinition: true)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 256, elements: !119)
!119 = !{!120, !125, !127, !131}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !3, line: 31, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 2)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !118, file: !3, line: 32, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !118, file: !3, line: 33, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !130)
!130 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !118, file: !3, line: 34, baseType: !121, size: 64, offset: 192)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !19, file: !134, line: 176, type: !135, isLocal: true, isDefinition: true)
!134 = !DIFile(filename: "../../multi-filters/lib/libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/root/anti-ddos-firewall/qname_filter", checksumkind: CSK_MD5, checksum: "32b0945df61015e3dd6be9ac5ea42778")
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!61, !138, !12, null}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !19, file: !134, line: 55, type: !141, isLocal: true, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!60, !60, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !19, file: !134, line: 77, type: !148, isLocal: true, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!61, !60, !144, !144, !129}
!151 = !{!152, !153, !154, !155, !156, !169, !170, !171, !172, !173, !178, !209, !210, !213, !222, !223, !224, !227, !228}
!152 = !DILocalVariable(name: "ctx", arg: 1, scope: !2, file: !3, line: 83, type: !7)
!153 = !DILocalVariable(name: "action", scope: !2, file: !3, line: 85, type: !6)
!154 = !DILocalVariable(name: "eth_type", scope: !2, file: !3, line: 86, type: !6)
!155 = !DILocalVariable(name: "ip_type", scope: !2, file: !3, line: 86, type: !6)
!156 = !DILocalVariable(name: "eth", scope: !2, file: !3, line: 87, type: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !159, line: 168, size: 112, elements: !160)
!159 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!160 = !{!161, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !158, file: !159, line: 169, baseType: !162, size: 48)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 48, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 6)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !158, file: !159, line: 170, baseType: !162, size: 48, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !158, file: !159, line: 171, baseType: !167, size: 16, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !168, line: 25, baseType: !62)
!168 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!169 = !DILocalVariable(name: "stk", scope: !2, file: !3, line: 88, type: !12)
!170 = !DILocalVariable(name: "stptr", scope: !2, file: !3, line: 89, type: !128)
!171 = !DILocalVariable(name: "data_end", scope: !2, file: !3, line: 90, type: !60)
!172 = !DILocalVariable(name: "data", scope: !2, file: !3, line: 91, type: !60)
!173 = !DILocalVariable(name: "nh", scope: !2, file: !3, line: 92, type: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !175, line: 33, size: 64, elements: !176)
!175 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/root/anti-ddos-firewall/qname_filter", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !174, file: !175, line: 34, baseType: !60, size: 64)
!178 = !DILocalVariable(name: "iph", scope: !179, file: !3, line: 100, type: !181)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 99, column: 39)
!180 = distinct !DILexicalBlock(scope: !2, file: !3, line: 99, column: 6)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !183, line: 87, size: 160, elements: !184)
!183 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !195}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !182, file: !183, line: 89, baseType: !65, size: 4, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !182, file: !183, line: 90, baseType: !65, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !182, file: !183, line: 97, baseType: !65, size: 8, offset: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !182, file: !183, line: 98, baseType: !167, size: 16, offset: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !182, file: !183, line: 99, baseType: !167, size: 16, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !182, file: !183, line: 100, baseType: !167, size: 16, offset: 48)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !182, file: !183, line: 101, baseType: !65, size: 8, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !182, file: !183, line: 102, baseType: !65, size: 8, offset: 72)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !182, file: !183, line: 103, baseType: !194, size: 16, offset: 80)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !168, line: 31, baseType: !62)
!195 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !183, line: 104, baseType: !196, size: 64, offset: 96)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !183, line: 104, size: 64, elements: !197)
!197 = !{!198, !204}
!198 = !DIDerivedType(tag: DW_TAG_member, scope: !196, file: !183, line: 104, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !196, file: !183, line: 104, size: 64, elements: !200)
!200 = !{!201, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !199, file: !183, line: 104, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !168, line: 27, baseType: !12)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !199, file: !183, line: 104, baseType: !202, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !196, file: !183, line: 104, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !196, file: !183, line: 104, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !205, file: !183, line: 104, baseType: !202, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !205, file: !183, line: 104, baseType: !202, size: 32, offset: 32)
!209 = !DILocalVariable(name: "hdrsize", scope: !179, file: !3, line: 101, type: !6)
!210 = !DILocalVariable(name: "udppld", scope: !211, file: !3, line: 125, type: !12)
!211 = distinct !DILexicalBlock(scope: !212, file: !3, line: 124, column: 30)
!212 = distinct !DILexicalBlock(scope: !2, file: !3, line: 124, column: 6)
!213 = !DILocalVariable(name: "h", scope: !211, file: !3, line: 126, type: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !216, line: 23, size: 64, elements: !217)
!216 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !215, file: !216, line: 24, baseType: !167, size: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !215, file: !216, line: 25, baseType: !167, size: 16, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !216, line: 26, baseType: !167, size: 16, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !215, file: !216, line: 27, baseType: !194, size: 16, offset: 48)
!222 = !DILocalVariable(name: "qrn", scope: !211, file: !3, line: 141, type: !62)
!223 = !DILocalVariable(name: "qlen", scope: !211, file: !3, line: 142, type: !12)
!224 = !DILocalVariable(name: "qlk", scope: !225, file: !3, line: 144, type: !98)
!225 = distinct !DILexicalBlock(scope: !226, file: !3, line: 143, column: 14)
!226 = distinct !DILexicalBlock(scope: !211, file: !3, line: 143, column: 6)
!227 = !DILocalVariable(name: "tval", scope: !225, file: !3, line: 151, type: !97)
!228 = !DILabel(scope: !2, name: "out", file: !3, line: 175)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 8)
!232 = !{i32 7, !"Dwarf Version", i32 5}
!233 = !{i32 2, !"Debug Info Version", i32 3}
!234 = !{i32 1, !"wchar_size", i32 4}
!235 = !{i32 7, !"frame-pointer", i32 2}
!236 = !{!"Ubuntu clang version 14.0.6"}
!237 = !DILocation(line: 0, scope: !2)
!238 = !DILocation(line: 88, column: 2, scope: !2)
!239 = !DILocation(line: 88, column: 8, scope: !2)
!240 = !{!241, !241, i64 0}
!241 = !{!"int", !242, i64 0}
!242 = !{!"omnipotent char", !243, i64 0}
!243 = !{!"Simple C/C++ TBAA"}
!244 = !DILocation(line: 90, column: 38, scope: !2)
!245 = !{!246, !241, i64 4}
!246 = !{!"xdp_md", !241, i64 0, !241, i64 4, !241, i64 8, !241, i64 12, !241, i64 16}
!247 = !DILocation(line: 90, column: 27, scope: !2)
!248 = !DILocation(line: 90, column: 19, scope: !2)
!249 = !DILocation(line: 91, column: 34, scope: !2)
!250 = !{!246, !241, i64 0}
!251 = !DILocation(line: 91, column: 23, scope: !2)
!252 = !DILocation(line: 91, column: 15, scope: !2)
!253 = !DILocalVariable(name: "nh", arg: 1, scope: !254, file: !175, line: 124, type: !257)
!254 = distinct !DISubprogram(name: "parse_ethhdr", scope: !175, file: !175, line: 124, type: !255, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !259)
!255 = !DISubroutineType(types: !256)
!256 = !{!6, !257, !60, !258}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!259 = !{!253, !260, !261}
!260 = !DILocalVariable(name: "data_end", arg: 2, scope: !254, file: !175, line: 125, type: !60)
!261 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !254, file: !175, line: 126, type: !258)
!262 = !DILocation(line: 0, scope: !254, inlinedAt: !263)
!263 = distinct !DILocation(line: 94, column: 13, scope: !2)
!264 = !DILocalVariable(name: "nh", arg: 1, scope: !265, file: !175, line: 79, type: !257)
!265 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !175, file: !175, line: 79, type: !266, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !273)
!266 = !DISubroutineType(types: !267)
!267 = !{!6, !257, !60, !258, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !175, line: 64, size: 32, elements: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !175, line: 65, baseType: !272, size: 32)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32, elements: !123)
!273 = !{!264, !274, !275, !276, !277, !278, !279, !285, !286}
!274 = !DILocalVariable(name: "data_end", arg: 2, scope: !265, file: !175, line: 80, type: !60)
!275 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !265, file: !175, line: 81, type: !258)
!276 = !DILocalVariable(name: "vlans", arg: 4, scope: !265, file: !175, line: 82, type: !268)
!277 = !DILocalVariable(name: "eth", scope: !265, file: !175, line: 84, type: !157)
!278 = !DILocalVariable(name: "hdrsize", scope: !265, file: !175, line: 85, type: !6)
!279 = !DILocalVariable(name: "vlh", scope: !265, file: !175, line: 86, type: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !175, line: 42, size: 32, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !281, file: !175, line: 43, baseType: !167, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !281, file: !175, line: 44, baseType: !167, size: 16, offset: 16)
!285 = !DILocalVariable(name: "h_proto", scope: !265, file: !175, line: 87, type: !62)
!286 = !DILocalVariable(name: "i", scope: !265, file: !175, line: 88, type: !6)
!287 = !DILocation(line: 0, scope: !265, inlinedAt: !288)
!288 = distinct !DILocation(line: 129, column: 9, scope: !254, inlinedAt: !263)
!289 = !DILocation(line: 93, column: 14, scope: !290, inlinedAt: !288)
!290 = distinct !DILexicalBlock(scope: !265, file: !175, line: 93, column: 6)
!291 = !DILocation(line: 93, column: 24, scope: !290, inlinedAt: !288)
!292 = !DILocation(line: 93, column: 6, scope: !265, inlinedAt: !288)
!293 = !DILocation(line: 99, column: 17, scope: !265, inlinedAt: !288)
!294 = !{!295, !295, i64 0}
!295 = !{!"short", !242, i64 0}
!296 = !DILocalVariable(name: "h_proto", arg: 1, scope: !297, file: !175, line: 68, type: !62)
!297 = distinct !DISubprogram(name: "proto_is_vlan", scope: !175, file: !175, line: 68, type: !298, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!6, !62}
!300 = !{!296}
!301 = !DILocation(line: 0, scope: !297, inlinedAt: !302)
!302 = distinct !DILocation(line: 106, column: 8, scope: !303, inlinedAt: !288)
!303 = distinct !DILexicalBlock(scope: !304, file: !175, line: 106, column: 7)
!304 = distinct !DILexicalBlock(scope: !305, file: !175, line: 105, column: 39)
!305 = distinct !DILexicalBlock(scope: !306, file: !175, line: 105, column: 2)
!306 = distinct !DILexicalBlock(scope: !265, file: !175, line: 105, column: 2)
!307 = !DILocation(line: 70, column: 20, scope: !297, inlinedAt: !302)
!308 = !DILocation(line: 70, column: 46, scope: !297, inlinedAt: !302)
!309 = !DILocation(line: 106, column: 8, scope: !303, inlinedAt: !288)
!310 = !DILocation(line: 106, column: 7, scope: !304, inlinedAt: !288)
!311 = !DILocation(line: 112, column: 18, scope: !304, inlinedAt: !288)
!312 = !DILocation(line: 99, column: 15, scope: !180)
!313 = !DILocation(line: 99, column: 6, scope: !2)
!314 = !DILocation(line: 0, scope: !179)
!315 = !DILocation(line: 103, column: 11, scope: !316)
!316 = distinct !DILexicalBlock(scope: !179, file: !3, line: 103, column: 7)
!317 = !DILocation(line: 103, column: 17, scope: !316)
!318 = !DILocation(line: 103, column: 15, scope: !316)
!319 = !DILocation(line: 103, column: 7, scope: !179)
!320 = !DILocation(line: 106, column: 18, scope: !179)
!321 = !DILocation(line: 106, column: 22, scope: !179)
!322 = !DILocation(line: 108, column: 14, scope: !323)
!323 = distinct !DILexicalBlock(scope: !179, file: !3, line: 108, column: 6)
!324 = !DILocation(line: 108, column: 6, scope: !179)
!325 = !DILocation(line: 112, column: 14, scope: !326)
!326 = distinct !DILexicalBlock(scope: !179, file: !3, line: 112, column: 7)
!327 = !DILocation(line: 112, column: 24, scope: !326)
!328 = !DILocation(line: 112, column: 7, scope: !179)
!329 = !DILocation(line: 116, column: 19, scope: !179)
!330 = !{!331, !242, i64 9}
!331 = !{!"iphdr", !242, i64 0, !242, i64 0, !242, i64 1, !295, i64 2, !295, i64 4, !295, i64 6, !242, i64 8, !242, i64 9, !295, i64 10, !242, i64 12}
!332 = !DILocation(line: 124, column: 14, scope: !212)
!333 = !DILocation(line: 124, column: 6, scope: !2)
!334 = !DILocation(line: 0, scope: !211)
!335 = !DILocation(line: 128, column: 9, scope: !336)
!336 = distinct !DILexicalBlock(scope: !211, file: !3, line: 128, column: 7)
!337 = !DILocation(line: 128, column: 15, scope: !336)
!338 = !DILocation(line: 128, column: 13, scope: !336)
!339 = !DILocation(line: 128, column: 7, scope: !211)
!340 = !DILocation(line: 137, column: 22, scope: !341)
!341 = distinct !DILexicalBlock(scope: !211, file: !3, line: 137, column: 6)
!342 = !DILocation(line: 137, column: 27, scope: !341)
!343 = !DILocation(line: 137, column: 6, scope: !211)
