; ModuleID = 'xdp_pass_kern.c'
source_filename = "xdp_pass_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [11 x i32]*, %struct.qname_lpm_key*, i32*, [1 x i32]*, [255 x i32]* }
%struct.qname_lpm_key = type { i32, [64 x i8] }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.udphdr = type { i16, i16, i16, i16 }

@main_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !0
@__const.xdp_patch_ports_func.____fmt = private unnamed_addr constant [19 x i8] c"blocked prefix: %d\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !58
@__const.get_qname_lpm_key.____fmt = private unnamed_addr constant [11 x i8] c"dm len:%d\0A\00", align 1
@__const.get_qname_lpm_key.____fmt.1 = private unnamed_addr constant [15 x i8] c"rev suffix:%s\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "main_map", scope: !2, file: !3, line: 33, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Alpine clang version 13.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !57, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_pass_kern.c", directory: "/root/qname_intercepter/qname_filter")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/root/qname_intercepter/qname_filter")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51, !54, !55}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !{!58, !0, !63, !71}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 144, type: !60, isLocal: false, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 32, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 4)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !65, line: 33, type: !66, isLocal: true, isDefinition: true)
!65 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/root/qname_intercepter/qname_filter")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!46, !46, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !65, line: 152, type: !73, isLocal: true, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !77, !79, null}
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 27, size: 320, elements: !81)
!81 = !{!82, !87, !96, !98, !103}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !3, line: 28, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 352, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 11)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !80, file: !3, line: 29, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qname_lpm_key", file: !3, line: 22, size: 544, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !89, file: !3, line: 23, baseType: !79, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rev_suf", scope: !89, file: !3, line: 24, baseType: !93, size: 512, offset: 32)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 512, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !80, file: !3, line: 30, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !3, line: 31, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 1)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !3, line: 32, baseType: !104, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 255)
!108 = !{i32 7, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{i32 7, !"frame-pointer", i32 2}
!112 = !{!"Alpine clang version 13.0.1"}
!113 = distinct !DISubprogram(name: "xdp_patch_ports_func", scope: !3, file: !3, line: 83, type: !114, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !124)
!114 = !DISubroutineType(types: !115)
!115 = !{!76, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !118)
!118 = !{!119, !120, !121, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !6, line: 2857, baseType: !79, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !117, file: !6, line: 2858, baseType: !79, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !117, file: !6, line: 2859, baseType: !79, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !117, file: !6, line: 2861, baseType: !79, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !117, file: !6, line: 2862, baseType: !79, size: 32, offset: 128)
!124 = !{!125, !126, !127, !128, !129, !142, !160, !192, !201, !202, !203, !208, !211, !212, !215, !216, !223}
!125 = !DILocalVariable(name: "ctx", arg: 1, scope: !113, file: !3, line: 83, type: !116)
!126 = !DILocalVariable(name: "action", scope: !113, file: !3, line: 85, type: !76)
!127 = !DILocalVariable(name: "eth_type", scope: !113, file: !3, line: 86, type: !76)
!128 = !DILocalVariable(name: "ip_type", scope: !113, file: !3, line: 86, type: !76)
!129 = !DILocalVariable(name: "eth", scope: !113, file: !3, line: 87, type: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !132, line: 169, size: 112, elements: !133)
!132 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!133 = !{!134, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !131, file: !132, line: 170, baseType: !135, size: 48)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 6)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !131, file: !132, line: 171, baseType: !135, size: 48, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !131, file: !132, line: 172, baseType: !140, size: 16, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !141, line: 25, baseType: !48)
!141 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!142 = !DILocalVariable(name: "iphdr", scope: !113, file: !3, line: 88, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !145, line: 86, size: 160, elements: !146)
!145 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !157, !159}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !144, file: !145, line: 88, baseType: !52, size: 4, flags: DIFlagBitField, extraData: i64 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !144, file: !145, line: 89, baseType: !52, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !144, file: !145, line: 96, baseType: !52, size: 8, offset: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !144, file: !145, line: 97, baseType: !140, size: 16, offset: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !144, file: !145, line: 98, baseType: !140, size: 16, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !144, file: !145, line: 99, baseType: !140, size: 16, offset: 48)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !144, file: !145, line: 100, baseType: !52, size: 8, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !144, file: !145, line: 101, baseType: !52, size: 8, offset: 72)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !144, file: !145, line: 102, baseType: !156, size: 16, offset: 80)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !141, line: 31, baseType: !48)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !144, file: !145, line: 103, baseType: !158, size: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !141, line: 27, baseType: !79)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !144, file: !145, line: 104, baseType: !158, size: 32, offset: 128)
!160 = !DILocalVariable(name: "ipv6hdr", scope: !113, file: !3, line: 89, type: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !163, line: 117, size: 320, elements: !164)
!163 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!164 = !{!165, !166, !167, !171, !172, !173, !174, !191}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !162, file: !163, line: 119, baseType: !52, size: 4, flags: DIFlagBitField, extraData: i64 0)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !162, file: !163, line: 120, baseType: !52, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !162, file: !163, line: 127, baseType: !168, size: 24, offset: 8)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 3)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !162, file: !163, line: 129, baseType: !140, size: 16, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !162, file: !163, line: 130, baseType: !52, size: 8, offset: 48)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !162, file: !163, line: 131, baseType: !52, size: 8, offset: 56)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !162, file: !163, line: 133, baseType: !175, size: 128, offset: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !176, line: 33, size: 128, elements: !177)
!176 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !175, file: !176, line: 40, baseType: !179, size: 128)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !175, file: !176, line: 34, size: 128, elements: !180)
!180 = !{!181, !185, !189}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !179, file: !176, line: 35, baseType: !182, size: 128)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 16)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !179, file: !176, line: 37, baseType: !186, size: 128)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !179, file: !176, line: 38, baseType: !190, size: 128)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !61)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !162, file: !163, line: 134, baseType: !175, size: 128, offset: 192)
!192 = !DILocalVariable(name: "udphdr", scope: !113, file: !3, line: 90, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !195, line: 23, size: 64, elements: !196)
!195 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!196 = !{!197, !198, !199, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !194, file: !195, line: 24, baseType: !140, size: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !194, file: !195, line: 25, baseType: !140, size: 16, offset: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !194, file: !195, line: 26, baseType: !140, size: 16, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !194, file: !195, line: 27, baseType: !156, size: 16, offset: 48)
!201 = !DILocalVariable(name: "data_end", scope: !113, file: !3, line: 91, type: !46)
!202 = !DILocalVariable(name: "data", scope: !113, file: !3, line: 92, type: !46)
!203 = !DILocalVariable(name: "nh", scope: !113, file: !3, line: 93, type: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !205, line: 33, size: 64, elements: !206)
!205 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/root/qname_intercepter/qname_filter")
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !204, file: !205, line: 34, baseType: !46, size: 64)
!208 = !DILocalVariable(name: "udppld", scope: !209, file: !3, line: 110, type: !79)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 109, column: 30)
!210 = distinct !DILexicalBlock(scope: !113, file: !3, line: 109, column: 6)
!211 = !DILocalVariable(name: "qrn", scope: !209, file: !3, line: 119, type: !48)
!212 = !DILocalVariable(name: "qlk", scope: !213, file: !3, line: 121, type: !89)
!213 = distinct !DILexicalBlock(scope: !214, file: !3, line: 120, column: 14)
!214 = distinct !DILexicalBlock(scope: !209, file: !3, line: 120, column: 6)
!215 = !DILocalVariable(name: "tval", scope: !213, file: !3, line: 126, type: !97)
!216 = !DILocalVariable(name: "____fmt", scope: !217, file: !3, line: 131, type: !220)
!217 = distinct !DILexicalBlock(scope: !218, file: !3, line: 131, column: 5)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 130, column: 9)
!219 = distinct !DILexicalBlock(scope: !213, file: !3, line: 127, column: 7)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 152, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 19)
!223 = !DILabel(scope: !113, name: "out", file: !3, line: 140)
!224 = !DILocation(line: 0, scope: !113)
!225 = !DILocation(line: 91, column: 38, scope: !113)
!226 = !{!227, !228, i64 4}
!227 = !{!"xdp_md", !228, i64 0, !228, i64 4, !228, i64 8, !228, i64 12, !228, i64 16}
!228 = !{!"int", !229, i64 0}
!229 = !{!"omnipotent char", !230, i64 0}
!230 = !{!"Simple C/C++ TBAA"}
!231 = !DILocation(line: 91, column: 27, scope: !113)
!232 = !DILocation(line: 91, column: 19, scope: !113)
!233 = !DILocation(line: 92, column: 34, scope: !113)
!234 = !{!227, !228, i64 0}
!235 = !DILocation(line: 92, column: 23, scope: !113)
!236 = !DILocation(line: 92, column: 15, scope: !113)
!237 = !DILocalVariable(name: "nh", arg: 1, scope: !238, file: !205, line: 124, type: !241)
!238 = distinct !DISubprogram(name: "parse_ethhdr", scope: !205, file: !205, line: 124, type: !239, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !243)
!239 = !DISubroutineType(types: !240)
!240 = !{!76, !241, !46, !242}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!243 = !{!237, !244, !245}
!244 = !DILocalVariable(name: "data_end", arg: 2, scope: !238, file: !205, line: 125, type: !46)
!245 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !238, file: !205, line: 126, type: !242)
!246 = !DILocation(line: 0, scope: !238, inlinedAt: !247)
!247 = distinct !DILocation(line: 95, column: 13, scope: !113)
!248 = !DILocalVariable(name: "nh", arg: 1, scope: !249, file: !205, line: 79, type: !241)
!249 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !205, file: !205, line: 79, type: !250, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !259)
!250 = !DISubroutineType(types: !251)
!251 = !{!76, !241, !46, !242, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !205, line: 64, size: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !253, file: !205, line: 65, baseType: !256, size: 32)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 2)
!259 = !{!248, !260, !261, !262, !263, !264, !265, !271, !272}
!260 = !DILocalVariable(name: "data_end", arg: 2, scope: !249, file: !205, line: 80, type: !46)
!261 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !249, file: !205, line: 81, type: !242)
!262 = !DILocalVariable(name: "vlans", arg: 4, scope: !249, file: !205, line: 82, type: !252)
!263 = !DILocalVariable(name: "eth", scope: !249, file: !205, line: 84, type: !130)
!264 = !DILocalVariable(name: "hdrsize", scope: !249, file: !205, line: 85, type: !76)
!265 = !DILocalVariable(name: "vlh", scope: !249, file: !205, line: 86, type: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !205, line: 42, size: 32, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !267, file: !205, line: 43, baseType: !140, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !267, file: !205, line: 44, baseType: !140, size: 16, offset: 16)
!271 = !DILocalVariable(name: "h_proto", scope: !249, file: !205, line: 87, type: !48)
!272 = !DILocalVariable(name: "i", scope: !249, file: !205, line: 88, type: !76)
!273 = !DILocation(line: 0, scope: !249, inlinedAt: !274)
!274 = distinct !DILocation(line: 129, column: 9, scope: !238, inlinedAt: !247)
!275 = !DILocation(line: 93, column: 14, scope: !276, inlinedAt: !274)
!276 = distinct !DILexicalBlock(scope: !249, file: !205, line: 93, column: 6)
!277 = !DILocation(line: 93, column: 24, scope: !276, inlinedAt: !274)
!278 = !DILocation(line: 93, column: 6, scope: !249, inlinedAt: !274)
!279 = !DILocation(line: 99, column: 17, scope: !249, inlinedAt: !274)
!280 = !{!281, !281, i64 0}
!281 = !{!"short", !229, i64 0}
!282 = !DILocalVariable(name: "h_proto", arg: 1, scope: !283, file: !205, line: 68, type: !48)
!283 = distinct !DISubprogram(name: "proto_is_vlan", scope: !205, file: !205, line: 68, type: !284, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !286)
!284 = !DISubroutineType(types: !285)
!285 = !{!76, !48}
!286 = !{!282}
!287 = !DILocation(line: 0, scope: !283, inlinedAt: !288)
!288 = distinct !DILocation(line: 106, column: 8, scope: !289, inlinedAt: !274)
!289 = distinct !DILexicalBlock(scope: !290, file: !205, line: 106, column: 7)
!290 = distinct !DILexicalBlock(scope: !291, file: !205, line: 105, column: 39)
!291 = distinct !DILexicalBlock(scope: !292, file: !205, line: 105, column: 2)
!292 = distinct !DILexicalBlock(scope: !249, file: !205, line: 105, column: 2)
!293 = !DILocation(line: 70, column: 20, scope: !283, inlinedAt: !288)
!294 = !DILocation(line: 70, column: 46, scope: !283, inlinedAt: !288)
!295 = !DILocation(line: 106, column: 7, scope: !290, inlinedAt: !274)
!296 = !DILocation(line: 109, column: 11, scope: !297, inlinedAt: !274)
!297 = distinct !DILexicalBlock(scope: !290, file: !205, line: 109, column: 7)
!298 = !DILocation(line: 109, column: 15, scope: !297, inlinedAt: !274)
!299 = !DILocation(line: 109, column: 7, scope: !290, inlinedAt: !274)
!300 = !DILocation(line: 112, column: 18, scope: !290, inlinedAt: !274)
!301 = !DILocation(line: 101, column: 6, scope: !113)
!302 = !DILocalVariable(name: "nh", arg: 1, scope: !303, file: !205, line: 151, type: !241)
!303 = distinct !DISubprogram(name: "parse_iphdr", scope: !205, file: !205, line: 151, type: !304, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !307)
!304 = !DISubroutineType(types: !305)
!305 = !{!76, !241, !46, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!307 = !{!302, !308, !309, !310, !311}
!308 = !DILocalVariable(name: "data_end", arg: 2, scope: !303, file: !205, line: 152, type: !46)
!309 = !DILocalVariable(name: "iphdr", arg: 3, scope: !303, file: !205, line: 153, type: !306)
!310 = !DILocalVariable(name: "iph", scope: !303, file: !205, line: 155, type: !143)
!311 = !DILocalVariable(name: "hdrsize", scope: !303, file: !205, line: 156, type: !76)
!312 = !DILocation(line: 0, scope: !303, inlinedAt: !313)
!313 = distinct !DILocation(line: 102, column: 13, scope: !314)
!314 = distinct !DILexicalBlock(scope: !315, file: !3, line: 101, column: 39)
!315 = distinct !DILexicalBlock(scope: !113, file: !3, line: 101, column: 6)
!316 = !DILocation(line: 158, column: 10, scope: !317, inlinedAt: !313)
!317 = distinct !DILexicalBlock(scope: !303, file: !205, line: 158, column: 6)
!318 = !DILocation(line: 158, column: 14, scope: !317, inlinedAt: !313)
!319 = !DILocation(line: 158, column: 6, scope: !303, inlinedAt: !313)
!320 = !DILocation(line: 161, column: 17, scope: !303, inlinedAt: !313)
!321 = !DILocation(line: 161, column: 21, scope: !303, inlinedAt: !313)
